Revit 2027 API
EdgeArrayArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual EdgeArrayArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As EdgeArrayArrayIterator
public:
virtual EdgeArrayArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> EdgeArrayArrayIterator
override ForwardIterator : unit -> EdgeArrayArrayIterator
Return Value
EdgeArrayArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
EdgeArrayArray Class
Autodesk.Revit.DB Namespace